uhorkovyprivarok/GEN4-FT813-50CTP-CLB-4D-Systems_a_TMS320F28335/KniznicaBT813/EVE_target.h
  For the SPI transfers single 8-Bit transfers are used with busy-wait for completion.
  While this is okay for AVRs that run at 16MHz with the SPI at 8 MHz and therefore do one transfer in 16 clock-cycles,
  this is wasteful for any 32 bit controller even at higher SPI speeds.

  Check out the section for SAMC21E18A as it has code to transparently add DMA.

  If the define "EVE_DMA" is set the spi_transmit_async() is changed at compile time to write in a buffer instead directly to SPI.
  EVE_init() calls EVE_init_dma() which sets up the DMA channel and enables an IRQ for end of DMA.
  EVE_start_cmd_burst() resets the DMA buffer instead of transferring the first bytes by SPI.
  EVE_end_cmd_burst() just calls EVE_start_dma_transfer() which triggers the transfer of the SPI buffer by DMA.
  EVE_busy() does nothing but to report that EVE is busy if there is an active DMA transfer.
  At the end of the DMA transfer an IRQ is executed which clears the DMA active state and calls EVE_cs_clear() by which the
  command buffer is executed by the command co-processor.

*/

#pragma once

#if !defined (ARDUINO)

    #if defined (__IMAGECRAFT__)
        #if defined (_AVR)
            #include <iccioavr.h>

            static inline void DELAY_MS(uint16_t val)
            {
                uint16_t counter;

                while(val > 0)
                {
                    for(counter=0; counter < 2000;counter++) // maybe ~1ms at 16MHz clock
                    {
                        __asm__ volatile ("nop");
                    }
                    val--;
                }
            }

            #if !defined (EVE_CS)
                #define EVE_CS_PORT PORTB
                #define EVE_CS      (1<<PB5)
                #define EVE_PDN_PORT    PORTB
                #define EVE_PDN     (1<<PB4)
            #endif

            static inline void EVE_pdn_set(void)
            {
                EVE_PDN_PORT &= ~EVE_PDN;   /* Power-Down low */
            }

            static inline void EVE_pdn_clear(void)
            {
                EVE_PDN_PORT |= EVE_PDN;    /* Power-Down high */
            }

            static inline void EVE_cs_set(void)
            {
                EVE_CS_PORT &= ~EVE_CS; /* cs low */
            }

            static inline void EVE_cs_clear(void)
            {
                EVE_CS_PORT |= EVE_CS;  /* cs high */
            }

            static inline void spi_transmit(uint8_t data)
            {
                SPDR = data; /* start transmission */
                while(!(SPSR & (1<<SPIF))) {}; /* wait for transmission to complete - 1us @ 8MHz SPI-Clock */
            }

            static inline void spi_transmit_32(uint32_t data)
            {
                spi_transmit((uint8_t)(data & 0x000000ff));
                spi_transmit((uint8_t)(data >> 8));
                spi_transmit((uint8_t)(data >> 16));
                spi_transmit((uint8_t)(data >> 24));
            }

            /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
            static inline void spi_transmit_burst(uint32_t data)
            {
                spi_transmit_32(data);
            }

            static inline uint8_t spi_receive(uint8_t data)
            {
                SPDR = data; /* start transmission */
                while(!(SPSR & (1<<SPIF))) {}; /* wait for transmission to complete - 1us @ 8MHz SPI-CLock */
                return SPDR;
            }

            static inline uint8_t fetch_flash_byte(const uint8_t *data)
            {
                return *data;
            }


        #endif
    #endif

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

    #if defined (__GNUC__)

        #if defined (__AVR_XMEGA__)

        #include <avr/io.h>
        #include <avr/pgmspace.h>
        #ifndef F_CPU
            #define F_CPU 32000000UL
        #endif      
        #include <util/delay.h>

        #define DELAY_MS(ms) _delay_ms(ms)

        #if !defined (EVE_CS)
            #define EVE_CS_PORT     PORTC
            #define EVE_CS          PIN4_bm
            #define EVE_PDN_PORT    PORTC
            #define EVE_PDN_PIN     PIN1_bm
            #define EVE_SPI         SPIC    /* the SPI port to use */
        #endif

        static inline void EVE_pdn_set(void)
        {
            EVE_PDN_PORT.OUTCLR = EVE_PDN_PIN;  /* Power-Down low */    
        }

        static inline void EVE_pdn_clear(void)
        {
            EVE_PDN_PORT.OUTSET = EVE_PDN_PIN;  /* Power-Down high */
        }

        static inline void EVE_cs_set(void)
        {
            EVE_CS_PORT.OUTCLR = EVE_CS;    /* cs low */
        }

        static inline void EVE_cs_clear(void)
        {
            EVE_CS_PORT.OUTSET= EVE_CS;     /* cs high */
        }

        static inline void spi_transmit(uint8_t data)
        {
            EVE_SPI.DATA = data;
            while(!(EVE_SPI.STATUS & 0x80)) {}; // wait for transmit complete
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            spi_transmit_32(data);
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
            EVE_SPI.DATA = data;
            while(!(EVE_SPI.STATUS & 0x80)) {}; // wait for transmit complete
            return EVE_SPI.DATA;
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            #if defined (__AVR_HAVE_ELPM__) /* we have an AVR with more than 64kB FLASH memory */
            return(pgm_read_byte_far(data));
            #else
            return(pgm_read_byte_near(data));
            #endif
        }

        #endif /* XMEGA */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

        #if defined (__AVR__) && ! defined (__AVR_XMEGA__)

        #include <avr/io.h>
        #include <avr/pgmspace.h>
        #define F_CPU 16000000UL
        #include <util/delay.h>

        #define DELAY_MS(ms) _delay_ms(ms)

        #if !defined (EVE_CS)
            #define EVE_CS_PORT PORTB
            #define EVE_CS      (1<<PB5)
            #define EVE_PDN_PORT    PORTB
            #define EVE_PDN     (1<<PB4)
        #endif

        static inline void EVE_pdn_set(void)
        {
            EVE_PDN_PORT &= ~EVE_PDN;   /* Power-Down low */
        }

        static inline void EVE_pdn_clear(void)
        {
            EVE_PDN_PORT |= EVE_PDN;    /* Power-Down high */
        }

        static inline void EVE_cs_set(void)
        {
            EVE_CS_PORT &= ~EVE_CS; /* cs low */
        }

        static inline void EVE_cs_clear(void)
        {
            EVE_CS_PORT |= EVE_CS;  /* cs high */
        }

        static inline void spi_transmit(uint8_t data)
        {
#if 1
            SPDR = data; /* start transmission */
            while(!(SPSR & (1<<SPIF))) {}; /* wait for transmission to complete - 1us @ 8MHz SPI-Clock */
#else
        /* software-spi example */
            uint8_t spiIndex  = 0x80;
            uint8_t k;

            for(k = 0; k <8; k++) // Output each bit of spiOutByte
            {
                if(data & spiIndex) // Output MOSI Bit
                {
                    PORTC |= (1<<PORTC1);
                }
                else
                {
                    PORTC &= ~(1<<PORTC1);
                }

                PORTA |= (1<<PORTA1); // toggle SCK
                PORTA &= ~(1<<PORTA1);

                spiIndex >>= 1;
            }
#endif
        }

