uhorkovyprivarok/GEN4-FT813-50CTP-CLB-4D-Systems_a_TMS320F28335/KniznicaBT813/EVE_target.h
        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            spi_transmit_32(data);
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
#if 1
            SPDR = data; /* start transmission */
            while(!(SPSR & (1<<SPIF))) {}; /* wait for transmission to complete - 1us @ 8MHz SPI-CLock */
            return SPDR;
#else
            uint8_t spiIndex  = 0x80;
            uint8_t spiInByte = 0;
            uint8_t k;

            for(k = 0; k <8; k++) // Output each bit of spiOutByte
            {
                if(data & spiIndex) // Output MOSI Bit
                {
                    PORTC |= (1<<PORTC1);
                }
                else
                {
                    PORTC &= ~(1<<PORTC1);
                }

                PORTA |= (1<<PORTA1); // toggle SCK
                PORTA &= ~(1<<PORTA1);

                if(PINC & (1<<PORTC0))
                {
                    spiInByte |= spiIndex;
                }

                spiIndex >>= 1;
            }
            return spiInByte;
#endif
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            #if defined (__AVR_HAVE_ELPM__) /* we have an AVR with more than 64kB FLASH memory */
                return(pgm_read_byte_far(data));
            #else
                return(pgm_read_byte_near(data));
            #endif
        }

        #endif /* AVR */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

        #if defined (__v851__)

        #include <stdint.h>
        #include "rh850_regs.h"
        #include "os.h"

        #define DELAY_MS(ms)    OS_Wait(ms * 1000)

        static inline void EVE_pdn_set(void)
        {
            P0 &= ~(1u<<6);
        }

        static inline void EVE_pdn_clear(void)
        {
            P0 |= (1u<<6);
        }

        static inline void EVE_cs_set(void)
        {
            P8 &= ~(1u<<2); /* manually set chip-select to low */
        }

        static inline void EVE_cs_clear(void)
        {
            P8 |= (1u<<2);  /* manually set chip-select to high */
        }

        static inline void spi_transmit(uint8_t data)
        {
            CSIH0CTL0 = 0xC1; /* CSIH2PWR = 1;  CSIH2TXE=1; CSIH2RXE = 0; direct access mode  */
            CSIH0TX0H = data;   /* start transmission */
            while(CSIH0STR0 & 0x00080) {};  /* wait for transmission to complete - 800ns @ 10MHz SPI-Clock */
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            spi_transmit_32(data);
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
            CSIH0CTL0 = 0xE1; /* CSIH2PWR = 1;  CSIH2TXE=1; CSIH2RXE = 1; direct access mode  */
            CSIH0TX0H = data;   /* start transmission */
            while(CSIH0STR0 & 0x00080) {};  /* wait for transmission to complete - 800ns @ 10MHz SPI-Clock */
            return (uint8_t) CSIH0RX0H;
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

        #endif /* RH850 */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

        #if defined (__TRICORE__)

        #include "types.h"
        #include "os.h"
        #include "dio.h"
        #include "spi.h"

        #define DELAY_MS(ms) OS_Wait(ms * 1000)

        static inline void EVE_pdn_set(void)
        {
            HW_DIO_SetSync(IO_DIO_DIGOUT_PD_TFT, 0);/* Power-Down low */
        }

        static inline void EVE_pdn_clear(void)
        {
            HW_DIO_SetSync(IO_DIO_DIGOUT_PD_TFT, 1);/* Power-Down high */
        }

        static inline void EVE_cs_set(void)
        {
            HW_DIO_SetSync(IO_DIO_DIGOUT_CS_TFT, 0); /* manually set chip-select to low */
        }

        static inline void EVE_cs_clear(void)
        {
            HW_DIO_SetSync(IO_DIO_DIGOUT_CS_TFT, 1);  /* manually set chip-select to high */
        }

        static inline void spi_transmit(uint8_t data)
        {
            SPI_ReceiveByte(data);
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            spi_transmit_32(data);
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
            return SPI_ReceiveByte(data);
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

        #endif /* __TRICORE__ */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

        #if defined (__SAMC21E18A__) || (__SAMC21J18A__)
        /* note: target as set by AtmelStudio, valid  are all from the same family */

