uhorkovyprivarok/GEN4-FT813-50CTP-CLB-4D-Systems_a_TMS320F28335/KniznicaBT813/EVE_target.h
        #include "sam.h"

        #if !defined (EVE_CS)
            #define EVE_CS_PORT 0
            #define EVE_CS PORT_PA05
            #define EVE_PDN_PORT 0
            #define EVE_PDN PORT_PA03
            #define EVE_SPI SERCOM0
            #define EVE_SPI_DMA_TRIGGER SERCOM0_DMAC_ID_TX
            #define EVE_DMA_CHANNEL 0
//          #define EVE_DMA
        #endif

        #define EVE_DELAY_1MS 8000  /* ~1ms at 48MHz Core-Clock */

        #if defined (EVE_DMA)
            extern uint32_t EVE_dma_buffer[1025];
            extern volatile uint16_t EVE_dma_buffer_index;
            extern volatile uint8_t EVE_dma_busy;

            void EVE_init_dma(void);
            void EVE_start_dma_transfer(void);
        #endif

        void DELAY_MS(uint16_t val);

        static inline void EVE_pdn_set(void)
        {
            PORT->Group[EVE_PDN_PORT].OUTCLR.reg = EVE_PDN;
        }

        static inline void EVE_pdn_clear(void)
        {
            PORT->Group[EVE_PDN_PORT].OUTSET.reg = EVE_PDN;
        }

        static inline void EVE_cs_set(void)
        {
            PORT->Group[EVE_CS_PORT].OUTCLR.reg = EVE_CS;
        }

        static inline void EVE_cs_clear(void)
        {
            PORT->Group[EVE_CS_PORT].OUTSET.reg = EVE_CS;
        }

        static inline void spi_transmit(uint8_t data)
        {
            EVE_SPI->SPI.DATA.reg = data;
            while((EVE_SPI->SPI.INTFLAG.reg & SERCOM_SPI_INTFLAG_TXC) == 0) {};
            (void) EVE_SPI->SPI.DATA.reg; /* dummy read-access to clear SERCOM_SPI_INTFLAG_RXC */
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            #if defined (EVE_DMA)
                EVE_dma_buffer[EVE_dma_buffer_index++] = data;
            #else
                spi_transmit_32(data);
            #endif
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
            EVE_SPI->SPI.DATA.reg = data;
            while((EVE_SPI->SPI.INTFLAG.reg & SERCOM_SPI_INTFLAG_TXC) == 0) {};
            return EVE_SPI->SPI.DATA.reg;
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

        #endif /* SAMC2x */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

        #if defined (__SAME51J19A__) || (__SAMD51P20A__) || (__SAMD51J19A__) || (__SAMD51G18A__)
        /* note: target as set by AtmelStudio, valid  are all from the same family */

        #include "sam.h"
        #include <stdbool.h>

        #if !defined (EVE_CS)
            #define EVE_CS_PORT 0
            #define EVE_CS PORT_PA00
            #define EVE_PDN_PORT 0
            #define EVE_PDN PORT_PA01
            #define EVE_SPI SERCOM5
            #define EVE_SPI_DMA_TRIGGER SERCOM5_DMAC_ID_TX
            #define EVE_DMA_CHANNEL 0
//          #define EVE_DMA
        #endif

        #define EVE_DELAY_1MS 20000 /* ~1ms at 120MHz Core-Clock and activated cache, according to my Logic-Analyzer */

        #if defined (EVE_DMA)
            extern uint32_t EVE_dma_buffer[1025];
            extern volatile uint16_t EVE_dma_buffer_index;
            extern volatile uint8_t EVE_dma_busy;

            void EVE_init_dma(void);
            void EVE_start_dma_transfer(void);
        #endif

        void DELAY_MS(uint16_t val);


        static inline void EVE_pdn_set(void)
        {
            PORT->Group[EVE_PDN_PORT].OUTCLR.reg = EVE_PDN;
        }

        static inline void EVE_pdn_clear(void)
        {
            PORT->Group[EVE_PDN_PORT].OUTSET.reg = EVE_PDN;
        }

        static inline void EVE_cs_set(void)
        {
            PORT->Group[EVE_CS_PORT].OUTCLR.reg = EVE_CS;
        }

        static inline void EVE_cs_clear(void)
        {
            PORT->Group[EVE_CS_PORT].OUTSET.reg = EVE_CS;
        }

        static inline void spi_transmit(uint8_t data)
        {
            EVE_SPI->SPI.DATA.reg = data;
            while((EVE_SPI->SPI.INTFLAG.reg & SERCOM_SPI_INTFLAG_TXC) == 0) {};
            (void) EVE_SPI->SPI.DATA.reg; /* dummy read-access to clear SERCOM_SPI_INTFLAG_RXC */
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            #if defined (EVE_DMA)
                EVE_dma_buffer[EVE_dma_buffer_index++] = data;
            #else
                spi_transmit_32(data);
            #endif
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
            EVE_SPI->SPI.DATA.reg = data;
            while((EVE_SPI->SPI.INTFLAG.reg & SERCOM_SPI_INTFLAG_TXC) == 0) {};
            return EVE_SPI->SPI.DATA.reg;
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

        #endif /* SAMx5x */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

