uhorkovyprivarok/GEN4-FT813-50CTP-CLB-4D-Systems_a_TMS320F28335/KniznicaBT813/EVE_target.h
        #if defined (__riscv)

//      #warning Compiling for GD32VF103CBT6

        #include "gd32vf103.h"

        static inline void DELAY_MS(uint16_t val)
        {
            uint16_t counter;

            while(val > 0)
            {
                for(counter=0; counter < 18000;counter++) /* ~1ms at 108MHz Core-Clock, according to my Logic-Analyzer */
                {
                    __asm__ volatile ("nop");
                }
                val--;
            }
        }

        static inline void EVE_pdn_set(void)
        {
            gpio_bit_reset(GPIOB,GPIO_PIN_1);
        }

        static inline void EVE_pdn_clear(void)
        {
            gpio_bit_set(GPIOB,GPIO_PIN_1);
        }

        static inline void EVE_cs_set(void)
        {
            gpio_bit_reset(GPIOB,GPIO_PIN_0);
        }

        static inline void EVE_cs_clear(void)
        {
            gpio_bit_set(GPIOB,GPIO_PIN_0);
        }

        static inline void spi_transmit(uint8_t data)
        {
                SPI_DATA(SPI0) = (uint32_t) data;
                while(SPI_STAT(SPI0) & SPI_STAT_TRANS) {};
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            spi_transmit_32(data);
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
                SPI_DATA(SPI0) = (uint32_t) data;
                while(SPI_STAT(SPI0) & SPI_STAT_TRANS) {};
                return (uint8_t) SPI_DATA(SPI0);
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

        #endif /* __riscv */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

        /* set with "build_flags" in platformio.ini or as defines in your build environment */
        #if defined (STM32L0) || (STM32F0) || (STM32F1) || (STM32F3) || (STM32F4) || (STM32G4) || (STM32H7)

        #if defined (STM32L0) /* set with "build_flags = -D STM32L0" in platformio.ini */
        #include "stm32l0xx.h"
        #include "stm32l0xx_hal.h"
        #include "stm32l0xx_ll_spi.h"
        #endif

        #if defined (STM32F0) /* set with "build_flags = -D STM32F0" in platformio.ini */
        #include "stm32f0xx.h"
        #include "stm32f0xx_hal.h"
        #include "stm32f0xx_ll_spi.h"
        #endif

        #if defined (STM32F1) /* set with "build_flags = -D STM32F1" in platformio.ini */
        #include "stm32f1xx.h"
        #include "stm32f1xx_hal.h"
        #include "stm32f1xx_ll_spi.h"
        #endif

        #if defined (STM32F3) /* set with "build_flags = -D STM32F3" in platformio.ini */
        #include "stm32f3xx.h"
        #include "stm32f3xx_hal.h"
        #include "stm32f3xx_ll_spi.h"
        #endif

        #if defined (STM32F4) /* set with "build_flags = -D STM32F4" in platformio.ini */
        #include "stm32f4xx.h"
        #include "stm32f4xx_hal.h"
        #include "stm32f4xx_ll_spi.h"
        #endif

        #if defined (STM32G4) /* set with "build_flags = -D STM32G4" in platformio.ini */
        #include "stm32g4xx.h"
        #include "stm32g4xx_hal.h"
        #include "stm32g4xx_ll_spi.h"
        #endif

        #if defined (STM32H7) /* set with "build_flags = -D STM32H7" in platformio.ini */
        #include "stm32h7xx.h"
        #include "stm32h7xx_hal.h"
        #include "stm32h7xx_ll_spi.h"
        #endif

        #if !defined (EVE_CS)
            #define EVE_CS_PORT GPIOD
            #define EVE_CS GPIO_PIN_12
            #define EVE_PDN_PORT GPIOD
            #define EVE_PDN GPIO_PIN_13
            #define EVE_SPI SPI1
            #define EVE_DMA_INSTANCE DMA2
            #define EVE_DMA_CHANNEL 3
            #define EVE_DMA_STREAM 3
    //      #define EVE_DMA     /* do not activate, it is not working yet */
        #endif

        #if defined (EVE_DMA)
            extern uint32_t EVE_dma_buffer[1025];
            extern volatile uint16_t EVE_dma_buffer_index;
            extern volatile uint8_t EVE_dma_busy;

            void EVE_init_dma(void);
            void EVE_start_dma_transfer(void);
        #endif

        #define DELAY_MS(ms) HAL_Delay(ms)

        static inline void EVE_pdn_clear(void)
        {
            HAL_GPIO_WritePin(EVE_PDN_PORT, EVE_PDN, GPIO_PIN_SET);
        }

        static inline void EVE_pdn_set(void)
        {
            HAL_GPIO_WritePin(EVE_PDN_PORT, EVE_PDN, GPIO_PIN_RESET);
        }

        static inline void EVE_cs_clear(void)
        {
            HAL_GPIO_WritePin(EVE_CS_PORT, EVE_CS, GPIO_PIN_SET);
        }

        static inline void EVE_cs_set(void)
        {
            HAL_GPIO_WritePin(EVE_CS_PORT, EVE_CS, GPIO_PIN_RESET);
        }

    #if defined (STM32H7)
        static inline void spi_transmit(uint8_t data)
        {
            LL_SPI_TransmitData8(EVE_SPI, data);
            while(!LL_SPI_IsActiveFlag_TXP(EVE_SPI)) {};
            while(!LL_SPI_IsActiveFlag_RXWNE(EVE_SPI)) {};
            LL_SPI_ReceiveData8(EVE_SPI); /* dummy read-access to clear SPI_SR_RXWNE */
        }
    #else
        static inline void spi_transmit(uint8_t data)
        {
            LL_SPI_TransmitData8(EVE_SPI, data);
            while(!LL_SPI_IsActiveFlag_TXE(EVE_SPI)) {};
            while(!LL_SPI_IsActiveFlag_RXNE(EVE_SPI)) {};
            LL_SPI_ReceiveData8(EVE_SPI); /* dummy read-access to clear SPI_SR_RXNE */
        }
    #endif

