uhorkovyprivarok/GEN4-FT813-50CTP-CLB-4D-Systems_a_TMS320F28335/KniznicaBT813/EVE_target.h
        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            #if defined (EVE_DMA)
                EVE_dma_buffer[EVE_dma_buffer_index++] = data;
            #else
                spi_transmit_32(data);
            #endif
        }

    #if defined (STM32H7)
        static inline uint8_t spi_receive(uint8_t data)
        {
            LL_SPI_TransmitData8(EVE_SPI, data);
            while(!LL_SPI_IsActiveFlag_TXP(EVE_SPI)) {};
            while(!LL_SPI_IsActiveFlag_RXWNE(EVE_SPI)) {};
            return LL_SPI_ReceiveData8(EVE_SPI);
        }
    #else
        static inline uint8_t spi_receive(uint8_t data)
        {
            LL_SPI_TransmitData8(EVE_SPI, data);
            while(!LL_SPI_IsActiveFlag_TXE(EVE_SPI)) {};
            while(!LL_SPI_IsActiveFlag_RXNE(EVE_SPI)) {};
            return LL_SPI_ReceiveData8(EVE_SPI);
        }
    #endif

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

        #endif  /* STM32 */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

        #if defined (ESP_PLATFORM)

        #include "driver/spi_master.h"
        #include "driver/gpio.h"
        #include "freertos/task.h"

        #if !defined (EVE_CS)
            #define EVE_CS      GPIO_NUM_13
            #define EVE_PDN     GPIO_NUM_12
            #define EVE_SCK     GPIO_NUM_18
            #define EVE_MISO    GPIO_NUM_19
            #define EVE_MOSI    GPIO_NUM_23
        #endif

        extern spi_device_handle_t EVE_spi_device;
        extern spi_device_handle_t EVE_spi_device_simple;

        #define EVE_DMA

        void DELAY_MS(uint16_t ms);

        void EVE_init_spi(void);

        static inline void EVE_cs_set(void)
        {
            spi_device_acquire_bus(EVE_spi_device_simple, portMAX_DELAY);
            gpio_set_level(EVE_CS, 0);
        }

        static inline void EVE_cs_clear(void)
        {
            gpio_set_level(EVE_CS, 1);
            spi_device_release_bus(EVE_spi_device_simple);
        }

        static inline void EVE_pdn_set(void)
        {
            gpio_set_level(EVE_PDN, 0);
        }

        static inline void EVE_pdn_clear(void)
        {
            gpio_set_level(EVE_PDN, 1);
        }

        #if defined (EVE_DMA)
            extern uint32_t EVE_dma_buffer[1025];
            extern volatile uint16_t EVE_dma_buffer_index;
            extern volatile uint8_t EVE_dma_busy;

            void EVE_init_dma(void);
            void EVE_start_dma_transfer(void);
        #endif

        static inline void spi_transmit(uint8_t data)
        {
            spi_transaction_t trans = {0};
            trans.length = 8;
            trans.rxlength = 0;
            trans.flags = SPI_TRANS_USE_TXDATA;
            trans.tx_data[0] = data;
            spi_device_polling_transmit(EVE_spi_device_simple, &trans);
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transaction_t trans = {0};
            trans.length = 32;
            trans.rxlength = 0;
            trans.flags = 0;
            trans.tx_buffer = &data;
            spi_device_polling_transmit(EVE_spi_device_simple, &trans);
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            #if defined (EVE_DMA)
                EVE_dma_buffer[EVE_dma_buffer_index++] = data;
            #else
                spi_transmit_32(data);
            #endif
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
            spi_transaction_t trans = {0};
            trans.length = 8;
            trans.rxlength = 8;
            trans.flags = (SPI_TRANS_USE_TXDATA | SPI_TRANS_USE_RXDATA);
            trans.tx_data[0] = data;
            spi_device_polling_transmit(EVE_spi_device_simple, &trans);

            return trans.rx_data[0];
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

    #endif /* ESP_PLATFORM */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

        #if defined (RP2040)
        /* note: set in platformio.ini by "build_flags = -D RP2040" */

        #include "pico/stdlib.h"
        #include "hardware/spi.h"

        #if !defined (EVE_CS)
            #define EVE_CS      5
            #define EVE_PDN     6
            #define EVE_SCK     2
            #define EVE_MOSI    3
            #define EVE_MISO    4
            #define EVE_SPI spi0
            #define EVE_DMA
        #endif

        #define DELAY_MS(ms) sleep_ms(ms)

        void EVE_init_spi(void);

        static inline void EVE_cs_set(void)
        {
            gpio_put(EVE_CS, 0);  // active low
        }

        static inline void EVE_cs_clear(void)
        {
            gpio_put(EVE_CS, 1);  // active high
        }

        static inline void EVE_pdn_set(void)
        {
            gpio_put(EVE_PDN, 0);
        }

        static inline void EVE_pdn_clear(void)
        {
            gpio_put(EVE_PDN, 1);
        }

        #if defined (EVE_DMA)
            extern uint32_t EVE_dma_buffer[1025];
            extern volatile uint16_t EVE_dma_buffer_index;
            extern volatile uint8_t EVE_dma_busy;

            void EVE_init_dma(void);
            void EVE_start_dma_transfer(void);
        #endif

        static inline void spi_transmit(uint8_t data)
        {
            spi_write_blocking(EVE_SPI, &data, 1);
        }

