uhorkovyprivarok/GEN4-FT813-50CTP-CLB-4D-Systems_a_TMS320F28335/KniznicaBT813/EVE_target.h
            #define EVE_DMA_CHANNEL 0
            #define EVE_DMAMUX_CHCFG_SOURCE 15 /* this needs to be the EDMA_REQ_LPSPIx_TX */
            #define EVE_DMA_IRQ  DMA0_IRQn
            #define EVE_DMA_IRQHandler DMA0_IRQHandler

            void EVE_init_dma(void);
            void EVE_start_dma_transfer(void);
        #endif

        static inline void spi_transmit(uint8_t data)
        {
#if 1
            while((EVE_SPI->S & SPI_S_SPTEF_MASK) == 0) {}
            EVE_SPI->DL = data;
            while((EVE_SPI->S & SPI_S_SPTEF_MASK) == 0) {}
            while((EVE_SPI->S & SPI_S_SPRF_MASK) == 0) {}
            (void) EVE_SPI->DL;
#else
            while((SPI_GetStatusFlags(EVE_SPI) & kSPI_TxBufferEmptyFlag) == 0) {}
            SPI_WriteData(EVE_SPI, data);
            while((SPI_GetStatusFlags(EVE_SPI) & kSPI_TxBufferEmptyFlag) == 0) {}
            while((SPI_GetStatusFlags(EVE_SPI) & kSPI_RxBufferFullFlag) == 0U)  {}
            (void) SPI_ReadData(EVE_SPI);
#endif
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            #if defined (EVE_DMA)
                EVE_dma_buffer[EVE_dma_buffer_index++] = data;
            #else
                spi_transmit_32(data);
            #endif
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
#if 0
            while((EVE_SPI->S & SPI_S_SPTEF_MASK) == 0) {}
            EVE_SPI->DL = data;
            while((EVE_SPI->S & SPI_S_SPTEF_MASK) == 0) {}
            while((EVE_SPI->S & SPI_S_SPRF_MASK) == 0) {}
            return EVE_SPI->DL;
#else
            while((SPI_GetStatusFlags(EVE_SPI) & kSPI_TxBufferEmptyFlag) == 0) {}
            SPI_WriteData(EVE_SPI, data);
            while((SPI_GetStatusFlags(EVE_SPI) & kSPI_TxBufferEmptyFlag) == 0) {}
            while((SPI_GetStatusFlags(EVE_SPI) & kSPI_RxBufferFullFlag) == 0U)  {}
            return SPI_ReadData(EVE_SPI);
#endif
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

        #endif /* K32L2B3 */


    #endif /* __GNUC__ */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

    #if defined (__TI_ARM__)

        #if defined (__MSP432P401R__)

        #include <ti/devices/msp432p4xx/inc/msp.h>
        #include <ti/devices/msp432p4xx/driverlib/driverlib.h>
        #include <stdint.h>

        #if !defined (EVE_CS)
            #define RIVERDI_PORT GPIO_PORT_P1
            #define RIVERDI_SIMO BIT6   // P1.6
            #define RIVERDI_SOMI BIT7   // P1.7
            #define RIVERDI_CLK BIT5    // P1.5
            #define EVE_CS_PORT         GPIO_PORT_P5
            #define EVE_CS              GPIO_PIN0           //P5.0
            #define EVE_PDN_PORT        GPIO_PORT_P5
            #define EVE_PDN             GPIO_PIN1           //P5.1
        #endif

        void EVE_SPI_Init(void);

        static inline void DELAY_MS(uint16_t val)
        {
            uint16_t counter;

            while(val > 0)
            {
                for(counter=0; counter < 8000;counter++) // ~1ms at 48MHz Core-Clock
                {
                    __nop();
                }
                val--;
            }
        }

        static inline void EVE_pdn_set(void)
        {
//            GPIO_setOutputLowOnPin(EVE_PDN_PORT,EVE_PDN);   /* Power-Down low */
            P5OUT &= ~EVE_PDN;   /* Power-Down low */
        }

        static inline void EVE_pdn_clear(void)
        {
//            GPIO_setOutputHighOnPin(EVE_PDN_PORT,EVE_PDN);   /* Power-Down high */
            P5OUT |= EVE_PDN;    /* Power-Down high */
        }

        static inline void EVE_cs_set(void)
        {
//            GPIO_setOutputLowOnPin(EVE_CS_PORT,EVE_CS);   /* CS low */
            P5OUT &= ~EVE_CS;   /* CS low */
        }

        static inline void EVE_cs_clear(void)
        {
//            GPIO_setOutputHighOnPin(EVE_CS_PORT,EVE_CS);    /* CS high */
            P5OUT |= EVE_CS;    /* CS high */
        }

        static inline void spi_transmit(uint8_t data)
        {
//            SPI_transmitData(EUSCI_B0_BASE, data);
//            while (!(SPI_getInterruptStatus(EUSCI_B0_BASE,EUSCI_B_SPI_TRANSMIT_INTERRUPT)));

            UCB0TXBUF_SPI = data;
            while(!(UCB0IFG_SPI & UCTXIFG)) {}; /* wait for transmission to complete */
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            #if defined (EVE_DMA)
                EVE_dma_buffer[EVE_dma_buffer_index++] = data;
            #else
                spi_transmit_32(data);
            #endif
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
//            SPI_transmitData(EUSCI_B0_BASE, data);
//            while (!(SPI_getInterruptStatus(EUSCI_B0_BASE,EUSCI_B_SPI_TRANSMIT_INTERRUPT)));
//            return EUSCI_B_CMSIS(EUSCI_B0_BASE)->RXBUF;

            UCB0TXBUF_SPI = data;
            while(!(UCB0IFG_SPI & UCTXIFG)) {}; /* wait for transmission to complete */
            return UCB0RXBUF_SPI;
         }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

        #endif /* __MSP432P401R__ */

    #endif /* __TI_ARM */
#endif

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

/* this is for TIs C2000 compiled with their ti-cgt-c2000 compiler which does not define this many symbols */
#if defined (__TMS320C28XX__)

    /* the designated target actually is a TMS320F28335 */
    #include <stdint.h>
    #include <DSP2833x_Device.h>

    typedef uint_least8_t uint8_t;

#if !defined (EVE_CS)
    //#define EVE_CS_PORT PORTB
    //#define EVE_CS      (1<<5)
    #define EVE_PDN_PORT            //PORTB
    #define EVE_PDN     (1<<4)
    #define PORTB
#endif

    /* 150MHz -> 6.67ns per cycle, one loop should be around 6 cycles -> 25000 loops for 1ms */
    #define EVE_DELAY_1MS 12000

    static inline void DELAY_MS(uint16_t val)
    {
        uint16_t counter;

        while(val > 0)
        {
            for(counter=0; counter < EVE_DELAY_1MS;counter++)
            {
                asm(" RPT #7 || NOP");
            }
            val--;
        }
    }

    static inline void EVE_pdn_set(void)
    {
        //EVE_PDN_PORT &= ~EVE_PDN;   /* Power-Down low */
        GpioDataRegs.GPACLEAR.bit.GPIO14 = 1; // clear SPI_PD to log. 0
        //GpioDataRegs.GPASET.bit.GPIO14 = 1;
    }

    static inline void EVE_pdn_clear(void)
    {
        //EVE_PDN_PORT |= EVE_PDN;    /* Power-Down high */
        GpioDataRegs.GPASET.bit.GPIO14 = 1; // set SPI_PD to log. 1
        //GpioDataRegs.GPACLEAR.bit.GPIO14 = 1;
    }

    static inline void EVE_cs_set(void)
    {
        //EVE_CS_PORT &= ~EVE_CS; /* cs low */
        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1; // clear SPI_CS to log. 0
    }

    static inline void EVE_cs_clear(void)
    {
        //EVE_CS_PORT |= EVE_CS;  /* cs high */
        //for( int i = 0; i < 10000 ; i++ );
        //asm(" RPT #60 || NOP");
        GpioDataRegs.GPASET.bit.GPIO19 = 1; // set SPI_CS to log. 1
    }

    static inline void spi_transmit(uint8_t data)
    {
        SpiaRegs.SPITXBUF = (data & 0xFF) << 8; // looks odd with data = uint8_t but uint8_t actually is 16 bits wide on this controller
        while(SpiaRegs.SPISTS.bit.INT_FLAG == 0); // wait for transmission to complete
        (void) SpiaRegs.SPIRXBUF; // dummy read to clear the flags
        asm(" RPT #60 || NOP");
    }

