uhorkovyprivarok/GEN4-FT813-50CTP-CLB-4D-Systems_a_TMS320F28335/KniznicaBT813/EVE_target.h
/*
    static inline uint8_t spi_transmit(uint8_t data)
    {
        while(SpiaRegs.SPISTS.bit.BUFFULL_FLAG == 1);       // wait for ready state
        if(SpiaRegs.SPISTS.bit.BUFFULL_FLAG == 0) SpiaRegs.SPITXBUF = (data & 0xFF) << 8;
        while(SpiaRegs.SPISTS.bit.INT_FLAG == 0);       // wait for transmission to complete
        return (SpiaRegs.SPIRXBUF & 0x00FF); // data are right justified in SPIRXBUF

        // Interrupt bit is the flag signaling the end of transmission,
        // but the only way to clear this bit is to read the receive buffer.
        // So, it is the same function as spi_receive. It is possible to
        // make an "alias" to avoid using same code twice - library author will decide :-)
    }
*/

    static inline void spi_transmit_32(uint32_t data)
    {
        spi_transmit((uint8_t)(data & 0x000000ff));
        spi_transmit((uint8_t)(data >> 8));
        spi_transmit((uint8_t)(data >> 16));
        spi_transmit((uint8_t)(data >> 24));
    }

    /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
    static inline void spi_transmit_burst(uint32_t data)
    {
        spi_transmit_32(data);
    }

    static inline uint8_t spi_receive(uint8_t data)
    {
        SpiaRegs.SPITXBUF = (data & 0xFF) << 8;
        while(SpiaRegs.SPISTS.bit.INT_FLAG == 0); // wait for transmission to complete
        asm(" RPT #60 || NOP");
        return (SpiaRegs.SPIRXBUF & 0x00FF); // data are right justified in SPIRXBUF
    }

    /*

    static inline uint8_t spi_receive(uint8_t data)
    {
        while(SpiaRegs.SPISTS.bit.BUFFULL_FLAG == 1);       // wait for ready state
        if(SpiaRegs.SPISTS.bit.BUFFULL_FLAG == 0) SpiaRegs.SPITXBUF = (data & 0xFF) << 8;
        while(SpiaRegs.SPISTS.bit.INT_FLAG == 0);       // wait for transmission to complete
        return (SpiaRegs.SPIRXBUF & 0x00FF); // data are right justified in SPIRXBUF
    }

    */

    static inline uint8_t fetch_flash_byte(const uint8_t *data)
    {
        return *data;
    }

#endif



/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

#if defined (ARDUINO)

    #include <Arduino.h>
    #include <stdio.h>
    #include "EVE_cpp_wrapper.h"

#ifdef __cplusplus
extern "C" {
#endif

    #if defined (__AVR__)
//  #if defined (ARDUINO_AVR_UNO)
        #include <avr/pgmspace.h>

        #if !defined (EVE_CS)
            #define EVE_CS      10
            #define EVE_PDN     8
        #endif

        static inline void EVE_cs_set(void)
        {
            digitalWrite(EVE_CS, LOW); /* make EVE listen */
        }

        static inline void EVE_cs_clear(void)
        {
            digitalWrite(EVE_CS, HIGH); /* tell EVE to stop listen */
        }

        static inline void spi_transmit(uint8_t data)
        {
//          wrapper_spi_transmit(data);
            SPDR = data;
            asm volatile("nop");
            while (!(SPSR & (1<<SPIF)));
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            spi_transmit_32(data);
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
            return wrapper_spi_receive(data);
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            #if defined(RAMPZ)
                return(pgm_read_byte_far(data));
            #else
                return(pgm_read_byte_near(data));
            #endif
        }

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

    #elif defined (ARDUINO_METRO_M4)

        #if !defined (EVE_CS)
            #define EVE_CS      10
            #define EVE_PDN     8
        #endif

        #define EVE_DMA

        #if defined (EVE_DMA)
            extern uint32_t EVE_dma_buffer[1025];
            extern volatile uint16_t EVE_dma_buffer_index;
            extern volatile uint8_t EVE_dma_busy;

            void EVE_init_dma(void);
            void EVE_start_dma_transfer(void);
        #endif

        static inline void EVE_cs_set(void)
        {
            digitalWrite(EVE_CS, LOW); /* make EVE listen */
        }

        static inline void EVE_cs_clear(void)
        {
            digitalWrite(EVE_CS, HIGH); /* tell EVE to stop listen */
        }

        static inline void spi_transmit(uint8_t data)
        {
            wrapper_spi_transmit(data);
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            #if defined (EVE_DMA)
                EVE_dma_buffer[EVE_dma_buffer_index++] = data;
            #else
                spi_transmit_32(data);
            #endif
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
            return wrapper_spi_receive(data);
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

    #elif defined (ARDUINO_NUCLEO_F446RE)
        #include "stm32f4xx_hal.h"
        #include "stm32f4xx_ll_spi.h"

        #if !defined (EVE_CS)
            #define EVE_CS      10
            #define EVE_PDN     8
            #define EVE_SPI SPI1
        #endif

        void EVE_init_spi(void);

        #define EVE_DMA

        #if defined (EVE_DMA)
            extern uint32_t EVE_dma_buffer[1025];
            extern volatile uint16_t EVE_dma_buffer_index;
            extern volatile uint8_t EVE_dma_busy;

            void EVE_init_dma(void);
            void EVE_start_dma_transfer(void);
        #endif

        static inline void EVE_cs_set(void)
        {
            digitalWrite(EVE_CS, LOW); /* make EVE listen */
        }

        static inline void EVE_cs_clear(void)
        {
            digitalWrite(EVE_CS, HIGH); /* tell EVE to stop listen */
        }

        static inline void spi_transmit(uint8_t data)
        {
//          SPI.transfer(data);
            LL_SPI_TransmitData8(EVE_SPI, data);
            while(!LL_SPI_IsActiveFlag_TXE(EVE_SPI)) {};
            while(!LL_SPI_IsActiveFlag_RXNE(EVE_SPI)) {};
            LL_SPI_ReceiveData8(EVE_SPI); /* dummy read-access to clear SPI_SR_RXNE */
        }

