uhorkovyprivarok/GEN4-FT813-50CTP-CLB-4D-Systems_a_TMS320F28335/KniznicaBT813/EVE_target.h
        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transmit((uint8_t)(data & 0x000000ff));
            spi_transmit((uint8_t)(data >> 8));
            spi_transmit((uint8_t)(data >> 16));
            spi_transmit((uint8_t)(data >> 24));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            #if defined (EVE_DMA)
                EVE_dma_buffer[EVE_dma_buffer_index++] = data;
            #else
                spi_transmit_32(data);
            #endif
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
//          return SPI.transfer(data);
            LL_SPI_TransmitData8(EVE_SPI, data);
            while(!LL_SPI_IsActiveFlag_TXE(EVE_SPI)) {};
            while(!LL_SPI_IsActiveFlag_RXNE(EVE_SPI)) {};
            return LL_SPI_ReceiveData8(EVE_SPI);
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

    #elif defined (ESP8266)

        #if !defined (EVE_CS)
            #define EVE_CS      D2  // D2 on D1 mini
            #define EVE_PDN     D1  // D1 on D1 mini
        #endif

        static inline void EVE_cs_set(void)
        {
            digitalWrite(EVE_CS, LOW); /* make EVE listen */
        }

        static inline void EVE_cs_clear(void)
        {
            digitalWrite(EVE_CS, HIGH); /* tell EVE to stop listen */
        }

        static inline void spi_transmit(uint8_t data)
        {
            wrapper_spi_transmit(data);
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            wrapper_spi_transmit_32(__builtin_bswap32(data));
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            #if defined (EVE_DMA)
                EVE_dma_buffer[EVE_dma_buffer_index++] = data;
            #else
                spi_transmit_32(data);
            #endif
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
            return wrapper_spi_receive(data);
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

    #elif defined (ESP32)
    /* note: this is using the ESP-IDF driver as the Arduino class and driver does not allow DMA for SPI */
        #include "driver/spi_master.h"

        #if !defined (EVE_CS)
            #define EVE_CS      13
            #define EVE_PDN     12
            #define EVE_SCK     18
            #define EVE_MISO    19
            #define EVE_MOSI    23
        #endif

        #define EVE_DMA

        void EVE_init_spi(void);

        extern spi_device_handle_t EVE_spi_device;
        extern spi_device_handle_t EVE_spi_device_simple;

        #if defined (EVE_DMA)
            extern uint32_t EVE_dma_buffer[1025];
            extern volatile uint16_t EVE_dma_buffer_index;
            extern volatile uint8_t EVE_dma_busy;

            void EVE_init_dma(void);
            void EVE_start_dma_transfer(void);
        #endif

        static inline void EVE_cs_set(void)
        {
            spi_device_acquire_bus(EVE_spi_device_simple, portMAX_DELAY);
            digitalWrite(EVE_CS, LOW); /* make EVE listen */
        }

        static inline void EVE_cs_clear(void)
        {
            digitalWrite(EVE_CS, HIGH); /* tell EVE to stop listen */
            spi_device_release_bus(EVE_spi_device_simple);
        }

        static inline void spi_transmit(uint8_t data)
        {
            spi_transaction_t trans = {0};
            trans.length = 8;
            trans.rxlength = 0;
            trans.flags = SPI_TRANS_USE_TXDATA;
            trans.tx_data[0] = data;
            spi_device_polling_transmit(EVE_spi_device_simple, &trans);
        }

        static inline void spi_transmit_32(uint32_t data)
        {
            spi_transaction_t trans = {0};
            trans.length = 32;
            trans.rxlength = 0;
            trans.flags = 0;
            trans.tx_buffer = &data;
            spi_device_polling_transmit(EVE_spi_device_simple, &trans);
        }

        /* spi_transmit_burst() is only used for cmd-FIFO commands so it *always* has to transfer 4 bytes */
        static inline void spi_transmit_burst(uint32_t data)
        {
            #if defined (EVE_DMA)
                EVE_dma_buffer[EVE_dma_buffer_index++] = data;
            #else
                spi_transmit_32(data);
            #endif
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
            spi_transaction_t trans = {0};
            trans.length = 8;
            trans.rxlength = 8;
            trans.flags = (SPI_TRANS_USE_TXDATA | SPI_TRANS_USE_RXDATA);
            trans.tx_data[0] = data;
            spi_device_polling_transmit(EVE_spi_device_simple, &trans);

            return trans.rx_data[0];
        }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

        #elif defined (ARDUINO_TEENSY41) || (ARDUINO_TEENSY35) /* note: this is mostly untested */

        #if !defined (EVE_CS)
            #define EVE_CS      10
            #define EVE_PDN     9
        #endif

        #define EVE_DMA

        #if defined (EVE_DMA)
        extern uint32_t EVE_dma_buffer[1025];
        extern volatile uint16_t EVE_dma_buffer_index;
        extern volatile uint8_t EVE_dma_busy;

        void EVE_init_dma(void);
        void EVE_start_dma_transfer(void);
        #endif

        static inline void EVE_cs_set(void)
        {
            digitalWrite(EVE_CS, LOW); /* make EVE listen */
        }

        static inline void EVE_cs_clear(void)
        {
            digitalWrite(EVE_CS, HIGH); /* tell EVE to stop listen */
        }

        static inline void spi_transmit(uint8_t data)
        {
            wrapper_spi_transmit(data);
        }

